<?php
return [
    0 => '请求成功',
    400 => '参数错误',
    401 => '未经授权',
    403 => '拒绝访问',
    404 => '未找到',
    405 => '不允许的方法',
    422 => '参数校验错误',
    429 => '频繁请求',
    500 => '服务器错误',

    10001 => '登录失败',
    10002 => '账号禁用',
    10003 => '上传文件类型错误',
    10004 => '账号或密码错误',
    10005 => '账户禁用',
    10006 => '原密码错误',
    10008 => '账号不存在',
    10011 => '添加失败',
    10012 => '修改失败',
    10013 => '没有权限',

    10015 => '导入Excel表失败',
    10016 => '导入Excel表格式错误',
    10017 => '导入Excel表格数据过大',
    10018 => '导入Excel表格数据为空',
    10019 => '导入Excel表格数据导入失败',
    10020 => '导入Excel表数据格式错误',
    10021 => '数据已存在，请勿添加重复数据',


    10025 => '文件生成失败',

    //权限
    20000 => '路由不能为空',
    20001 => '添加角色失败',
    20002 => '编辑角色失败',
    20003 => '角色不存在',
    20004 => '删除失败',
    20005 => '超级管理员不能删除',
    20006 => '超级管理员不能编辑',
    20007 => '账号已存在',





];
